MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M120F6TB/mcu.h
/**
 * @brief SWDT
 */
typedef struct {
    __IO uint32_t CR;
    __IO uint32_t SR;
    __IO uint32_t RR;
} CM_SWDT_TypeDef;

/**
 * @brief TMR0
 */
typedef struct {
    __IO uint32_t CNTAR;
    uint8_t RESERVED0[4];
    __IO uint32_t CMPAR;
    uint8_t RESERVED1[4];
    __IO uint32_t BCONR;
    __IO uint32_t STFLR;
} CM_TMR0_TypeDef;

/**
 * @brief TMR2
 */
typedef struct {
    __IO uint32_t CNTAR;
    uint8_t RESERVED0[4];
    __IO uint32_t CMPAR;
    uint8_t RESERVED1[4];
    __IO uint32_t BCONR;
    __IO uint32_t ICONR;
    __IO uint32_t PCONR;
    __IO uint32_t HCONR;
    __IO uint32_t STFLR;
} CM_TMR2_TypeDef;

/**
 * @brief TMR4
 */
typedef struct {
    uint8_t RESERVED0[2];
    __IO uint16_t OCCRUH;
    uint8_t RESERVED1[2];
    __IO uint16_t OCCRUL;
    uint8_t RESERVED2[2];
    __IO uint16_t OCCRVH;
    uint8_t RESERVED3[2];
    __IO uint16_t OCCRVL;
    uint8_t RESERVED4[2];
    __IO uint16_t OCCRWH;
    uint8_t RESERVED5[2];
    __IO uint16_t OCCRWL;
    __IO uint16_t OCSRU;
    __IO uint16_t OCERU;
    __IO uint16_t OCSRV;
    __IO uint16_t OCERV;
    __IO uint16_t OCSRW;
    __IO uint16_t OCERW;
    __IO uint16_t OCMRHUH;
    uint8_t RESERVED6[2];
    __IO uint32_t OCMRLUL;
    __IO uint16_t OCMRHVH;
    uint8_t RESERVED7[2];
    __IO uint32_t OCMRLVL;
    __IO uint16_t OCMRHWH;
    uint8_t RESERVED8[2];
    __IO uint32_t OCMRLWL;
    uint8_t RESERVED9[6];
    __IO uint16_t CPSR;
    uint8_t RESERVED10[2];
    __IO uint16_t CNTR;
    __IO uint16_t CCSR;
    __IO uint16_t CVPR;
    uint8_t RESERVED11[54];
    __IO uint16_t PFSRU;
    __IO uint16_t PDARU;
    __IO uint16_t PDBRU;
    uint8_t RESERVED12[2];
    __IO uint16_t PFSRV;
    __IO uint16_t PDARV;
    __IO uint16_t PDBRV;
    uint8_t RESERVED13[2];
    __IO uint16_t PFSRW;
    __IO uint16_t PDARW;
    __IO uint16_t PDBRW;
    __IO uint16_t POCRU;
    uint8_t RESERVED14[2];
    __IO uint16_t POCRV;
    uint8_t RESERVED15[2];
    __IO uint16_t POCRW;
    uint8_t RESERVED16[2];
    __IO uint16_t RCSR;
    uint8_t RESERVED17[12];
    __IO uint16_t SCCRUH;
    uint8_t RESERVED18[2];
    __IO uint16_t SCCRUL;
    uint8_t RESERVED19[2];
    __IO uint16_t SCCRVH;
    uint8_t RESERVED20[2];
    __IO uint16_t SCCRVL;
    uint8_t RESERVED21[2];
    __IO uint16_t SCCRWH;
    uint8_t RESERVED22[2];
    __IO uint16_t SCCRWL;
    __IO uint16_t SCSRUH;
    __IO uint16_t SCMRUH;
    __IO uint16_t SCSRUL;
    __IO uint16_t SCMRUL;
    __IO uint16_t SCSRVH;
    __IO uint16_t SCMRVH;
    __IO uint16_t SCSRVL;
    __IO uint16_t SCMRVL;
    __IO uint16_t SCSRWH;
    __IO uint16_t SCMRWH;
    __IO uint16_t SCSRWL;
    __IO uint16_t SCMRWL;
    uint8_t RESERVED23[824];
    __IO uint32_t ECSR;
} CM_TMR4_TypeDef;

/**
 * @brief TMRA
 */
typedef struct {
    __IO uint16_t CNTER;
    uint8_t RESERVED0[2];
    __IO uint16_t PERAR;
    uint8_t RESERVED1[58];
    __IO uint16_t CMPAR1;
    uint8_t RESERVED2[2];
    __IO uint16_t CMPAR2;
    uint8_t RESERVED3[58];
    __IO uint8_t  BCSTRL;
    __IO uint8_t  BCSTRH;
    uint8_t RESERVED4[2];
    __IO uint16_t HCONR;
    uint8_t RESERVED5[2];
    __IO uint16_t HCUPR;
    uint8_t RESERVED6[2];
    __IO uint16_t HCDOR;
    uint8_t RESERVED7[2];
    __IO uint16_t ICONR;
    uint8_t RESERVED8[2];
    __IO uint16_t ECONR;
    uint8_t RESERVED9[2];
    __IO uint16_t FCONR;
    uint8_t RESERVED10[2];
    __IO uint16_t STFLR;
    uint8_t RESERVED11[34];
    __IO uint16_t BCONR;
    uint8_t RESERVED12[62];
    __IO uint16_t CCONR1;
    uint8_t RESERVED13[2];
    __IO uint16_t CCONR2;
    uint8_t RESERVED14[58];
    __IO uint16_t PCONR1;
    uint8_t RESERVED15[2];
    __IO uint16_t PCONR2;
} CM_TMRA_TypeDef;

/**
 * @brief TMRB
 */
typedef struct {
    __IO uint16_t CNTER;
    uint8_t RESERVED0[2];
    __IO uint16_t PERAR;
    uint8_t RESERVED1[58];
    __IO uint16_t CMPAR;
    uint8_t RESERVED2[62];
    __IO uint8_t  BCSTRL;
    __IO uint8_t  BCSTRH;
    uint8_t RESERVED3[2];
    __IO uint16_t HCONR;
    uint8_t RESERVED4[2];
    __IO uint16_t HCUPR;
    uint8_t RESERVED5[2];
    __IO uint16_t HCDOR;
    uint8_t RESERVED6[2];
    __IO uint16_t ICONR;
    uint8_t RESERVED7[2];
    __IO uint16_t ECONR;
    uint8_t RESERVED8[6];
    __IO uint16_t STFLR;
    uint8_t RESERVED9[98];
    __IO uint16_t CCONR;
    uint8_t RESERVED10[62];
    __IO uint16_t PCONR;
} CM_TMRB_TypeDef;

/**
 * @brief USART
 */
typedef struct {
    __I  uint32_t SR;
    __IO uint16_t TDR;
    __I  uint16_t RDR;
    __IO uint32_t BRR;
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    __IO uint32_t CR3;
    __IO uint32_t PR;
} CM_USART_TypeDef;

/******************************************************************************/
/*                     Memory Base Address                                    */
/******************************************************************************/
#define EFM_BASE                             (0x00000000UL)   /*!< EFM base address in the alias region */
#define SRAM_BASE                            (0x20000000UL)   /*!< SRAM base address in the alias region */

/******************************************************************************/
/*           Device Specific Peripheral Base Address                          */
/******************************************************************************/
#define CM_ADC_BASE                          (0x4000B800UL)
#define CM_AOS_BASE                          (0x40000C00UL)
#define CM_CMP1_BASE                         (0x4000C800UL)
#define CM_CMP2_BASE                         (0x4000C810UL)
#define CM_CMU_BASE                          (0x40014400UL)
#define CM_CRC_BASE                          (0x40015400UL)
#define CM_CTC_BASE                          (0x40000000UL)
#define CM_DBGC_BASE                         (0x40015000UL)
#define CM_DBGC_T_BASE                       (0xE0042000UL)
#define CM_DMA_BASE                          (0x40013000UL)
#define CM_EFM_BASE                          (0x40000800UL)
#define CM_EMB_BASE                          (0x40006C00UL)
#define CM_GPIO_BASE                         (0x40013800UL)
#define CM_I2C_BASE                          (0x40004800UL)
#define CM_ICG_BASE                          (0x000000C0UL)
#define CM_INTC_BASE                         (0x40011000UL)
#define CM_PWC_BASE                          (0x40014000UL)
#define CM_RMU_BASE                          (0x40014100UL)
#define CM_SPI_BASE                          (0x40003800UL)
#define CM_SWDT_BASE                         (0x4000CC00UL)
#define CM_TMR0_BASE                         (0x40005800UL)
#define CM_TMR2_BASE                         (0x40006000UL)
#define CM_TMR4_BASE                         (0x40006800UL)
#define CM_TMRA_BASE                         (0x40007000UL)
#define CM_TMRB_1_BASE                       (0x40007800UL)
#define CM_TMRB_2_BASE                       (0x40007C00UL)
#define CM_TMRB_3_BASE                       (0x40008000UL)
#define CM_TMRB_4_BASE                       (0x40008400UL)
#define CM_USART1_BASE                       (0x40001800UL)
#define CM_USART2_BASE                       (0x40001C00UL)
#define CM_USART3_BASE                       (0x40002000UL)

/******************************************************************************/
/*           Device Specific Peripheral declaration & memory map              */
/******************************************************************************/
#define CM_ADC                               ((CM_ADC_TypeDef *)CM_ADC_BASE)
#define CM_AOS                               ((CM_AOS_TypeDef *)CM_AOS_BASE)
#define CM_CMP1                              ((CM_CMP_TypeDef *)CM_CMP1_BASE)
#define CM_CMP2                              ((CM_CMP_TypeDef *)CM_CMP2_BASE)
#define CM_CMU                               ((CM_CMU_TypeDef *)CM_CMU_BASE)
#define CM_CRC                               ((CM_CRC_TypeDef *)CM_CRC_BASE)
#define CM_CTC                               ((CM_CTC_TypeDef *)CM_CTC_BASE)
#define CM_DBGC                              ((CM_DBGC_TypeDef *)CM_DBGC_BASE)
#define CM_DBGC_T                            ((CM_DBGC_T_TypeDef *)CM_DBGC_T_BASE)
#define CM_DMA                               ((CM_DMA_TypeDef *)CM_DMA_BASE)
#define CM_EFM                               ((CM_EFM_TypeDef *)CM_EFM_BASE)
#define CM_EMB                               ((CM_EMB_TypeDef *)CM_EMB_BASE)
#define CM_GPIO                              ((CM_GPIO_TypeDef *)CM_GPIO_BASE)
#define CM_I2C                               ((CM_I2C_TypeDef *)CM_I2C_BASE)
#define CM_ICG                               ((CM_ICG_TypeDef *)CM_ICG_BASE)
#define CM_INTC                              ((CM_INTC_TypeDef *)CM_INTC_BASE)
#define CM_PWC                               ((CM_PWC_TypeDef *)CM_PWC_BASE)
#define CM_RMU                               ((CM_RMU_TypeDef *)CM_RMU_BASE)
#define CM_SPI                               ((CM_SPI_TypeDef *)CM_SPI_BASE)
#define CM_SWDT                              ((CM_SWDT_TypeDef *)CM_SWDT_BASE)
#define CM_TMR0                              ((CM_TMR0_TypeDef *)CM_TMR0_BASE)
#define CM_TMR2                              ((CM_TMR2_TypeDef *)CM_TMR2_BASE)
#define CM_TMR4                              ((CM_TMR4_TypeDef *)CM_TMR4_BASE)
#define CM_TMRA                              ((CM_TMRA_TypeDef *)CM_TMRA_BASE)
#define CM_TMRB_1                            ((CM_TMRB_TypeDef *)CM_TMRB_1_BASE)
#define CM_TMRB_2                            ((CM_TMRB_TypeDef *)CM_TMRB_2_BASE)
#define CM_TMRB_3                            ((CM_TMRB_TypeDef *)CM_TMRB_3_BASE)
#define CM_TMRB_4                            ((CM_TMRB_TypeDef *)CM_TMRB_4_BASE)
#define CM_USART1                            ((CM_USART_TypeDef *)CM_USART1_BASE)
#define CM_USART2                            ((CM_USART_TypeDef *)CM_USART2_BASE)
#define CM_USART3                            ((CM_USART_TypeDef *)CM_USART3_BASE)

/******************************************************************************/
/*                   Peripheral Registers Bits Definition                     */
/******************************************************************************/

