MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M120F6TB/mcu.h
/*  Bit definition for AOS_TMR2_HTSSR register  */
#define AOS_TMR2_HTSSR_TRGSEL                          (0x0000007FUL)
#define AOS_TMR2_HTSSR_TRGSEL_0                        (0x00000001UL)
#define AOS_TMR2_HTSSR_TRGSEL_1                        (0x00000002UL)
#define AOS_TMR2_HTSSR_TRGSEL_2                        (0x00000004UL)
#define AOS_TMR2_HTSSR_TRGSEL_3                        (0x00000008UL)
#define AOS_TMR2_HTSSR_TRGSEL_4                        (0x00000010UL)
#define AOS_TMR2_HTSSR_TRGSEL_5                        (0x00000020UL)
#define AOS_TMR2_HTSSR_TRGSEL_6                        (0x00000040UL)

/*  Bit definition for AOS_TMRA_HTSSR register  */
#define AOS_TMRA_HTSSR_TRGSEL                          (0x0000007FUL)
#define AOS_TMRA_HTSSR_TRGSEL_0                        (0x00000001UL)
#define AOS_TMRA_HTSSR_TRGSEL_1                        (0x00000002UL)
#define AOS_TMRA_HTSSR_TRGSEL_2                        (0x00000004UL)
#define AOS_TMRA_HTSSR_TRGSEL_3                        (0x00000008UL)
#define AOS_TMRA_HTSSR_TRGSEL_4                        (0x00000010UL)
#define AOS_TMRA_HTSSR_TRGSEL_5                        (0x00000020UL)
#define AOS_TMRA_HTSSR_TRGSEL_6                        (0x00000040UL)

/*  Bit definition for AOS_TMRB_HTSSR register  */
#define AOS_TMRB_HTSSR_TRGSEL                          (0x0000007FUL)
#define AOS_TMRB_HTSSR_TRGSEL_0                        (0x00000001UL)
#define AOS_TMRB_HTSSR_TRGSEL_1                        (0x00000002UL)
#define AOS_TMRB_HTSSR_TRGSEL_2                        (0x00000004UL)
#define AOS_TMRB_HTSSR_TRGSEL_3                        (0x00000008UL)
#define AOS_TMRB_HTSSR_TRGSEL_4                        (0x00000010UL)
#define AOS_TMRB_HTSSR_TRGSEL_5                        (0x00000020UL)
#define AOS_TMRB_HTSSR_TRGSEL_6                        (0x00000040UL)

/*  Bit definition for AOS_ADC_ITRGSELR0 register  */
#define AOS_ADC_ITRGSELR0_TRGSEL                       (0x0000007FUL)
#define AOS_ADC_ITRGSELR0_TRGSEL_0                     (0x00000001UL)
#define AOS_ADC_ITRGSELR0_TRGSEL_1                     (0x00000002UL)
#define AOS_ADC_ITRGSELR0_TRGSEL_2                     (0x00000004UL)
#define AOS_ADC_ITRGSELR0_TRGSEL_3                     (0x00000008UL)
#define AOS_ADC_ITRGSELR0_TRGSEL_4                     (0x00000010UL)
#define AOS_ADC_ITRGSELR0_TRGSEL_5                     (0x00000020UL)
#define AOS_ADC_ITRGSELR0_TRGSEL_6                     (0x00000040UL)

/*  Bit definition for AOS_ADC_ITRGSELR1 register  */
#define AOS_ADC_ITRGSELR1_TRGSEL                       (0x0000007FUL)
#define AOS_ADC_ITRGSELR1_TRGSEL_0                     (0x00000001UL)
#define AOS_ADC_ITRGSELR1_TRGSEL_1                     (0x00000002UL)
#define AOS_ADC_ITRGSELR1_TRGSEL_2                     (0x00000004UL)
#define AOS_ADC_ITRGSELR1_TRGSEL_3                     (0x00000008UL)
#define AOS_ADC_ITRGSELR1_TRGSEL_4                     (0x00000010UL)
#define AOS_ADC_ITRGSELR1_TRGSEL_5                     (0x00000020UL)
#define AOS_ADC_ITRGSELR1_TRGSEL_6                     (0x00000040UL)

/*  Bit definition for AOS_DMA_TRGSEL0 register  */
#define AOS_DMA_TRGSEL0_TRGSEL                         (0x0000007FUL)
#define AOS_DMA_TRGSEL0_TRGSEL_0                       (0x00000001UL)
#define AOS_DMA_TRGSEL0_TRGSEL_1                       (0x00000002UL)
#define AOS_DMA_TRGSEL0_TRGSEL_2                       (0x00000004UL)
#define AOS_DMA_TRGSEL0_TRGSEL_3                       (0x00000008UL)
#define AOS_DMA_TRGSEL0_TRGSEL_4                       (0x00000010UL)
#define AOS_DMA_TRGSEL0_TRGSEL_5                       (0x00000020UL)
#define AOS_DMA_TRGSEL0_TRGSEL_6                       (0x00000040UL)

/*  Bit definition for AOS_DMA_TRGSEL1 register  */
#define AOS_DMA_TRGSEL1_TRGSEL                         (0x0000007FUL)
#define AOS_DMA_TRGSEL1_TRGSEL_0                       (0x00000001UL)
#define AOS_DMA_TRGSEL1_TRGSEL_1                       (0x00000002UL)
#define AOS_DMA_TRGSEL1_TRGSEL_2                       (0x00000004UL)
#define AOS_DMA_TRGSEL1_TRGSEL_3                       (0x00000008UL)
#define AOS_DMA_TRGSEL1_TRGSEL_4                       (0x00000010UL)
#define AOS_DMA_TRGSEL1_TRGSEL_5                       (0x00000020UL)
#define AOS_DMA_TRGSEL1_TRGSEL_6                       (0x00000040UL)

/*******************************************************************************
                Bit definition for Peripheral CMP
*******************************************************************************/
/*  Bit definition for CMP_MDR register  */
#define CMP_MDR_CENB_POS                               (0U)
#define CMP_MDR_CENB                                   (0x01U)
#define CMP_MDR_CWDE_POS                               (1U)
#define CMP_MDR_CWDE                                   (0x02U)
#define CMP_MDR_CMON_POS                               (7U)
#define CMP_MDR_CMON                                   (0x80U)

/*  Bit definition for CMP_FIR register  */
#define CMP_FIR_FCKS_POS                               (0U)
#define CMP_FIR_FCKS                                   (0x03U)
#define CMP_FIR_FCKS_0                                 (0x01U)
#define CMP_FIR_FCKS_1                                 (0x02U)
#define CMP_FIR_EDGS_POS                               (4U)
#define CMP_FIR_EDGS                                   (0x30U)
#define CMP_FIR_EDGS_0                                 (0x10U)
#define CMP_FIR_EDGS_1                                 (0x20U)
#define CMP_FIR_CIEN_POS                               (6U)
#define CMP_FIR_CIEN                                   (0x40U)

/*  Bit definition for CMP_OCR register  */
#define CMP_OCR_COEN_POS                               (0U)
#define CMP_OCR_COEN                                   (0x01U)
#define CMP_OCR_COPS_POS                               (1U)
#define CMP_OCR_COPS                                   (0x02U)
#define CMP_OCR_CPOE_POS                               (2U)
#define CMP_OCR_CPOE                                   (0x04U)
#define CMP_OCR_TWOE_POS                               (3U)
#define CMP_OCR_TWOE                                   (0x08U)
#define CMP_OCR_TWOL_POS                               (4U)
#define CMP_OCR_TWOL                                   (0x10U)

