MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M120F6TB/mcu.h
typedef struct {
    __I  uint32_t TC0;
    __I  uint32_t TC1;
    uint32_t RESERVED0[14];
    __I  uint32_t BTC0;
    __I  uint32_t BTC1;
    uint32_t RESERVED1[14];
} stc_dma_intstat1_bit_t;

typedef struct {
    __IO uint32_t MSKTRNERR0;
    __IO uint32_t MSKTRNERR1;
    uint32_t RESERVED0[14];
    __IO uint32_t MSKREQERR0;
    __IO uint32_t MSKREQERR1;
    uint32_t RESERVED1[14];
} stc_dma_intmask0_bit_t;

typedef struct {
    __IO uint32_t MSKTC0;
    __IO uint32_t MSKTC1;
    uint32_t RESERVED0[14];
    __IO uint32_t MSKBTC0;
    __IO uint32_t MSKBTC1;
    uint32_t RESERVED1[14];
} stc_dma_intmask1_bit_t;

typedef struct {
    __O  uint32_t CLRTRNERR0;
    __O  uint32_t CLRTRNERR1;
    uint32_t RESERVED0[14];
    __O  uint32_t CLRREQERR0;
    __O  uint32_t CLRREQERR1;
    uint32_t RESERVED1[14];
} stc_dma_intclr0_bit_t;

typedef struct {
    __O  uint32_t CLRTC0;
    __O  uint32_t CLRTC1;
    uint32_t RESERVED0[14];
    __O  uint32_t CLRBTC0;
    __O  uint32_t CLRBTC1;
    uint32_t RESERVED1[14];
} stc_dma_intclr1_bit_t;

typedef struct {
    __I  uint32_t DMAACT;
    uint32_t RESERVED0[31];
} stc_dma_chstat_bit_t;

typedef struct {
    uint32_t RESERVED0[28];
    __IO uint32_t LLPEN;
    __IO uint32_t LLPRUN;
    uint32_t RESERVED1[2];
} stc_dma_chctl0_bit_t;

typedef struct {
    uint32_t RESERVED0[24];
    __IO uint32_t RPTNSEN;
    uint32_t RESERVED1[7];
} stc_dma_chctl1_bit_t;

typedef struct {
    __IO uint32_t FSTP;
    uint32_t RESERVED0[31];
} stc_efm_fstp_bit_t;

typedef struct {
    __IO uint32_t FLWT;
    uint32_t RESERVED0[15];
    __IO uint32_t CACHE;
    __IO uint32_t PREFETE;
    __IO uint32_t CRST;
    uint32_t RESERVED1[13];
} stc_efm_frmc_bit_t;

typedef struct {
    __IO uint32_t PEMODE;
    uint32_t RESERVED0[7];
    __IO uint32_t BUSHLDCTL;
    uint32_t RESERVED1[23];
} stc_efm_fwmc_bit_t;

typedef struct {
    __I  uint32_t PEWERR;
    __I  uint32_t PEPRTERR;
    uint32_t RESERVED0[1];
    __I  uint32_t PGMISMTCH;
    __I  uint32_t OPTEND;
    __I  uint32_t COLERR;
    uint32_t RESERVED1[2];
    __I  uint32_t RDY;
    uint32_t RESERVED2[23];
} stc_efm_fsr_bit_t;

typedef struct {
    __IO uint32_t PEWERRCLR;
    __IO uint32_t PEPRTERRCLR;
    uint32_t RESERVED0[1];
    __IO uint32_t PGMISMTCHCLR;
    __IO uint32_t OPTENDCLR;
    __IO uint32_t COLERRCLR;
    uint32_t RESERVED1[26];
} stc_efm_fsclr_bit_t;

typedef struct {
    __IO uint32_t PEERRITE;
    __IO uint32_t OPTENDITE;
    __IO uint32_t COLERRITE;
    uint32_t RESERVED0[29];
} stc_efm_fite_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t DFDIS;
    uint32_t RESERVED1[9];
    __IO uint32_t NMIS;
    __IO uint32_t IRS;
    __IO uint32_t IRDIS;
    __IO uint32_t LVDDIS;
} stc_efm_lvdicgcr_bit_t;

typedef struct {
    __IO uint32_t PORTINEN;
    __IO uint32_t CMPEN1;
    __IO uint32_t CMPEN2;
    uint32_t RESERVED0[2];
    __IO uint32_t OSCSTPEN;
    __IO uint32_t PWMSEN0;
    __IO uint32_t PWMSEN1;
    __IO uint32_t PWMSEN2;
    uint32_t RESERVED1[21];
    __IO uint32_t NFEN;
    __IO uint32_t INVSEL;
} stc_emb_ctl_bit_t;

typedef struct {
    __IO uint32_t PWMLV0;
    __IO uint32_t PWMLV1;
    __IO uint32_t PWMLV2;
    uint32_t RESERVED0[29];
} stc_emb_pwmlv_bit_t;

typedef struct {
    __IO uint32_t SOE;
    uint32_t RESERVED0[31];
} stc_emb_soe_bit_t;

typedef struct {
    __I  uint32_t PORTINF;
    __I  uint32_t PWMSF;
    __I  uint32_t CMPF;
    __I  uint32_t OSF;
    __I  uint32_t PORTINST;
    __I  uint32_t PWMST;
    uint32_t RESERVED0[26];
} stc_emb_stat_bit_t;

typedef struct {
    __O  uint32_t PORTINFCLR;
    __O  uint32_t PWMSFCLR;
    __O  uint32_t CMPFCLR;
    __O  uint32_t OSFCLR;
    uint32_t RESERVED0[28];
} stc_emb_statclr_bit_t;

typedef struct {
    __IO uint32_t PORTININTEN;
    __IO uint32_t PWMSINTEN;
    __IO uint32_t CMPINTEN;
    __IO uint32_t OSINTEN;
    uint32_t RESERVED0[28];
} stc_emb_inten_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    __I  uint32_t PIN1;
    uint32_t RESERVED0[6];
} stc_gpio_pidr0_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    __I  uint32_t PIN1;
    __I  uint32_t PIN2;
    __I  uint32_t PIN3;
    __I  uint32_t PIN4;
    __I  uint32_t PIN5;
    __I  uint32_t PIN6;
    __I  uint32_t PIN7;
} stc_gpio_pidr1_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    __I  uint32_t PIN1;
    __I  uint32_t PIN2;
    __I  uint32_t PIN3;
    uint32_t RESERVED0[4];
} stc_gpio_pidr2_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    __I  uint32_t PIN1;
    uint32_t RESERVED0[6];
} stc_gpio_pidr3_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    uint32_t RESERVED0[7];
} stc_gpio_pidr4_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    __I  uint32_t PIN1;
    uint32_t RESERVED0[6];
} stc_gpio_pidr5_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    __I  uint32_t PIN1;
    __I  uint32_t PIN2;
    uint32_t RESERVED0[5];
} stc_gpio_pidr6_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    uint32_t RESERVED0[7];
} stc_gpio_pidr7_bit_t;

typedef struct {
    __I  uint32_t PIN0;
    __I  uint32_t PIN1;
    __I  uint32_t PIN2;
    uint32_t RESERVED0[5];
} stc_gpio_pidr12_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __I  uint32_t PIN7;
} stc_gpio_pidr13_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __I  uint32_t PIN7;
} stc_gpio_pidr14_bit_t;

typedef struct {
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    uint32_t RESERVED0[6];
} stc_gpio_podr0_bit_t;

typedef struct {
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    __IO uint32_t POUT2;
    __IO uint32_t POUT3;
    __IO uint32_t POUT4;
    __IO uint32_t POUT5;
    __IO uint32_t POUT6;
    __IO uint32_t POUT7;
} stc_gpio_podr1_bit_t;

typedef struct {
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    __IO uint32_t POUT2;
    __IO uint32_t POUT3;
    uint32_t RESERVED0[4];
} stc_gpio_podr2_bit_t;

typedef struct {
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    uint32_t RESERVED0[6];
} stc_gpio_podr3_bit_t;

typedef struct {
    __IO uint32_t POUT0;
    uint32_t RESERVED0[7];
} stc_gpio_podr4_bit_t;

