MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M120F6TB/mcu.h
typedef struct {
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    uint32_t RESERVED0[6];
} stc_gpio_podr5_bit_t;

typedef struct {
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    __IO uint32_t POUT2;
    uint32_t RESERVED0[5];
} stc_gpio_podr6_bit_t;

typedef struct {
    __IO uint32_t POUT0;
    uint32_t RESERVED0[7];
} stc_gpio_podr7_bit_t;

typedef struct {
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    __IO uint32_t POUT2;
    uint32_t RESERVED0[5];
} stc_gpio_podr12_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __IO uint32_t POUT7;
} stc_gpio_podr13_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __IO uint32_t POUT7;
} stc_gpio_podr14_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    uint32_t RESERVED0[6];
} stc_gpio_poer0_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    __IO uint32_t POUTE2;
    __IO uint32_t POUTE3;
    __IO uint32_t POUTE4;
    __IO uint32_t POUTE5;
    __IO uint32_t POUTE6;
    __IO uint32_t POUTE7;
} stc_gpio_poer1_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    __IO uint32_t POUTE2;
    __IO uint32_t POUTE3;
    uint32_t RESERVED0[4];
} stc_gpio_poer2_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    uint32_t RESERVED0[6];
} stc_gpio_poer3_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    uint32_t RESERVED0[7];
} stc_gpio_poer4_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    uint32_t RESERVED0[6];
} stc_gpio_poer5_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    __IO uint32_t POUTE2;
    uint32_t RESERVED0[5];
} stc_gpio_poer6_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    uint32_t RESERVED0[7];
} stc_gpio_poer7_bit_t;

typedef struct {
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    __IO uint32_t POUTE2;
    uint32_t RESERVED0[5];
} stc_gpio_poer12_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __IO uint32_t POUTE7;
} stc_gpio_poer13_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __IO uint32_t POUTE7;
} stc_gpio_poer14_bit_t;

typedef struct {
    __O  uint32_t POS0;
    __O  uint32_t POS1;
    uint32_t RESERVED0[6];
} stc_gpio_posr0_bit_t;

typedef struct {
    __O  uint32_t POS0;
    __O  uint32_t POS1;
    __O  uint32_t POS2;
    __O  uint32_t POS3;
    __O  uint32_t POS4;
    __O  uint32_t POS5;
    __O  uint32_t POS6;
    __O  uint32_t POS7;
} stc_gpio_posr1_bit_t;

typedef struct {
    __O  uint32_t POS0;
    __O  uint32_t POS1;
    __O  uint32_t POS2;
    __O  uint32_t POS3;
    uint32_t RESERVED0[4];
} stc_gpio_posr2_bit_t;

typedef struct {
    __O  uint32_t POS0;
    __O  uint32_t POS1;
    uint32_t RESERVED0[6];
} stc_gpio_posr3_bit_t;

typedef struct {
    __O  uint32_t POS0;
    uint32_t RESERVED0[7];
} stc_gpio_posr4_bit_t;

typedef struct {
    __O  uint32_t POS0;
    __O  uint32_t POS1;
    uint32_t RESERVED0[6];
} stc_gpio_posr5_bit_t;

typedef struct {
    __O  uint32_t POS0;
    __O  uint32_t POS1;
    __O  uint32_t POS2;
    uint32_t RESERVED0[5];
} stc_gpio_posr6_bit_t;

typedef struct {
    __O  uint32_t POS0;
    uint32_t RESERVED0[7];
} stc_gpio_posr7_bit_t;

typedef struct {
    __O  uint32_t POS0;
    __O  uint32_t POS1;
    __O  uint32_t POS2;
    uint32_t RESERVED0[5];
} stc_gpio_posr12_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __O  uint32_t POS7;
} stc_gpio_posr13_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __O  uint32_t POS7;
} stc_gpio_posr14_bit_t;

typedef struct {
    __O  uint32_t POR0;
    __O  uint32_t POR1;
    uint32_t RESERVED0[6];
} stc_gpio_porr0_bit_t;

typedef struct {
    __O  uint32_t POR0;
    __O  uint32_t POR1;
    __O  uint32_t POR2;
    __O  uint32_t POR3;
    __O  uint32_t POR4;
    __O  uint32_t POR5;
    __O  uint32_t POR6;
    __O  uint32_t POR7;
} stc_gpio_porr1_bit_t;

typedef struct {
    __O  uint32_t POR0;
    __O  uint32_t POR1;
    __O  uint32_t POR2;
    __O  uint32_t POR3;
    uint32_t RESERVED0[4];
} stc_gpio_porr2_bit_t;

typedef struct {
    __O  uint32_t POR0;
    __O  uint32_t POR1;
    uint32_t RESERVED0[6];
} stc_gpio_porr3_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __O  uint32_t POR1;
    uint32_t RESERVED1[6];
} stc_gpio_porr4_bit_t;

typedef struct {
    __O  uint32_t POR0;
    __O  uint32_t POR1;
    uint32_t RESERVED0[6];
} stc_gpio_porr5_bit_t;

typedef struct {
    __O  uint32_t POR0;
    __O  uint32_t POR1;
    __O  uint32_t POR2;
    uint32_t RESERVED0[5];
} stc_gpio_porr6_bit_t;

typedef struct {
    __O  uint32_t POR0;
    uint32_t RESERVED0[7];
} stc_gpio_porr7_bit_t;

typedef struct {
    __O  uint32_t POR0;
    __O  uint32_t POR1;
    __O  uint32_t POR2;
    uint32_t RESERVED0[5];
} stc_gpio_porr12_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __O  uint32_t POR7;
} stc_gpio_porr13_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __O  uint32_t POR7;
} stc_gpio_porr14_bit_t;

typedef struct {
    __O  uint32_t POT0;
    __O  uint32_t POT1;
    uint32_t RESERVED0[6];
} stc_gpio_potr0_bit_t;

typedef struct {
    __O  uint32_t POT0;
    __O  uint32_t POT1;
    __O  uint32_t POT2;
    __O  uint32_t POT3;
    __O  uint32_t POT4;
    __O  uint32_t POT5;
    __O  uint32_t POT6;
    __O  uint32_t POT7;
} stc_gpio_potr1_bit_t;

typedef struct {
    __O  uint32_t POT0;
    __O  uint32_t POT1;
    __O  uint32_t POT2;
    __O  uint32_t POT3;
    uint32_t RESERVED0[4];
} stc_gpio_potr2_bit_t;

typedef struct {
    __O  uint32_t POT0;
    __O  uint32_t POT1;
    uint32_t RESERVED0[6];
} stc_gpio_potr3_bit_t;

typedef struct {
    __O  uint32_t POT0;
    uint32_t RESERVED0[7];
} stc_gpio_potr4_bit_t;

typedef struct {
    __O  uint32_t POT0;
    __O  uint32_t POT1;
    uint32_t RESERVED0[6];
} stc_gpio_potr5_bit_t;

typedef struct {
    __O  uint32_t POT0;
    __O  uint32_t POT1;
    __O  uint32_t POT2;
    uint32_t RESERVED0[5];
} stc_gpio_potr6_bit_t;

typedef struct {
    __O  uint32_t POT0;
    uint32_t RESERVED0[7];
} stc_gpio_potr7_bit_t;

